Education/03-interface/hw1_2_CommandButton/src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Education/03-interface/hw1_2_CommandButton/src/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Education/03-interface/hw1_2_CommandButton/src/Catalogs/Контрагенты/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтрокаСЦифрами = "0123456789";
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Отказ = Истина;
		Сообщить ("Поле «ИНН» не заполнено!");
	КонецЕсли;
	
	Если ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		
		Если (СтрДлина(ИНН) > 0) И (СтрДлина(ИНН)<> 12) Тогда
			Отказ = Истина;
			Сообщить ("ИНН физического лица должен содержать 12 цифр!");
		Иначе
			Для Позиция = 1 По СтрДлина(ИНН) Цикл
				Символ = Сред (ИНН, Позиция, 1);
				НеЦифра = (СтрНайти(СтрокаСЦифрами,Символ) = 0);
				
				Если НеЦифра Тогда
					Сообщить ("ИНН может содержать только цифры!");
					Отказ = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПП) Тогда 
			Отказ = Истина;
			Сообщить ("У физического лица не должно быть КПП!");
		КонецЕсли;
		
	ИначеЕсли ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		
		Если (СтрДлина(ИНН) > 0) И (СтрДлина(ИНН) <> 10) Тогда
			Отказ = Истина;
			Сообщить ("ИНН юридического лица должен содержать 10 цифр!");
		ИначеЕсли РаботаСИНН.ИННВерен(ИНН) <> Истина Тогда
			Отказ = Истина;
			Сообщить ("ИНН юридического лица не верен!");
		Иначе
			Для Позиция = 1 По СтрДлина(ИНН) Цикл
				Символ = Сред (ИНН, Позиция, 1);
				НеЦифра = (СтрНайти(СтрокаСЦифрами,Символ) = 0);
				
				Если НеЦифра Тогда
					Сообщить ("ИНН может содержать только цифры!");
					Отказ = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КПП) Тогда
			Отказ = Истина;
			Сообщить ("Для юридического лица обязательно указание КПП!");
		ИначеЕсли СтрДлина(КПП) <> 9 Тогда
			Отказ = Истина;
			Сообщить ("КПП должен содержать 9 цифр!");
		Иначе
			Для Позиция = 1 По СтрДлина(КПП) Цикл
				Символ = Сред (КПП, Позиция, 1);
				НеЦифра = (СтрНайти(СтрокаСЦифрами,Символ) = 0);
				
				Если НеЦифра Тогда
					Сообщить ("КПП может содержать только цифры!");
					Отказ = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла
		КонецЕсли;
		
	КонецЕсли;	
	
	//Сообщить("Обработка проверки заполнения:" + КонтекстВыполненияКлиентСервер.ТекущийКонтекст());

КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
КонецПроцедуры
